app/controllers/patients_controller.rb

INSERT INTO "patients" ("age", "created_at", "name", "provider", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 23], ["created_at", "2015-04-04 13:38:13.246573"], ["name", "Reichardt, Matthew"], ["provider", "McGregger, She"], ["updated_at", "2015-04-04 13:38:13.246573"]]
---
  def create
    @patient = Patient.new(patient_params)

    if @patient.save

SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "patients" SET "provider" = ?, "updated_at" = ? WHERE "patients"."id" = 1  [["provider", "Reichardt, Matthew"], ["updated_at", "2015-04-04 13:38:21.901316"]]
---
  def update
    @patient = Patient.find(params[:id])

    if @patient.update(patient_params)

SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @patient = Patient.find(params[:id])

SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 3]]
---
  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy

SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @patient = Patient.find(params[:id])